---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarLayoutRule.NumberWithSpacing
enum: Autodesk.Revit.DB.Structure.RebarLayoutRule
source: html/bc9034d0-5055-c55e-2686-b221d156ed48.htm
---
# Autodesk.Revit.DB.Structure.RebarLayoutRule.NumberWithSpacing

Both the spacing between rebar and the number of rebar are constant based on input.